<?php
$array = array (
    0 =>
        array (
            'code' => '355',
            'name' => 'ألبانيا',
        ),
    1 =>
        array (
            'code' => '213',
            'name' => 'الجزائر',
        ),
    2 =>
        array (
            'code' => '93',
            'name' => 'أفغانستان',
        ),
    3 =>
        array (
            'code' => '54',
            'name' => 'الأرجنتين',
        ),
    4 =>
        array (
            'code' => '971',
            'name' => 'الإمارات العربية المتحدة',
        ),
    5 =>
        array (
            'code' => '968',
            'name' => 'عمان',
        ),
    6 =>
        array (
            'code' => '374',
            'name' => 'أرمينيا',
        ),
    7 =>
        array (
            'code' => '994',
            'name' => 'أذربيجان',
        ),
    8 =>
        array (
            'code' => '353',
            'name' => 'أيرلندا',
        ),
    9 =>
        array (
            'code' => '20',
            'name' => 'مصر',
        ),
    10 =>
        array (
            'code' => '251',
            'name' => 'إثيوبيا',
        ),
    11 =>
        array (
            'code' => '372',
            'name' => 'استونيا',
        ),
    12 =>
        array (
            'code' => '61',
            'name' => 'أستراليا',
        ),
    13 =>
        array (
            'code' => '43',
            'name' => 'النمسا',
        ),
    14 =>
        array (
            'code' => '853',
            'name' => 'ماكاو (الصين)',
        ),
    15 =>
        array (
            'code' => '376',
            'name' => 'جمهورية أندورا',
        ),
    16 =>
        array (
            'code' => '244',
            'name' => 'أنغولا',
        ),
    17 =>
        array (
            'code' => '1264',
            'name' => 'أنغيلا',
        ),
    18 =>
        array (
            'code' => '1268',
            'name' => 'أنتيغوا وبربودا',
        ),
    19 =>
        array (
            'code' => '1246',
            'name' => 'بربادوس',
        ),
    20 =>
        array (
            'code' => '971',
            'name' => 'بابوا غينيا الجديدة',
        ),
    21 =>
        array (
            'code' => '1242',
            'name' => 'جزر البهاما',
        ),
    22 =>
        array (
            'code' => '92',
            'name' => 'باكستان',
        ),
    23 =>
        array (
            'code' => '595',
            'name' => 'باراغواي',
        ),
    24 =>
        array (
            'code' => '970',
            'name' => 'فلسطين',
        ),
    25 =>
        array (
            'code' => '973',
            'name' => 'البحرين',
        ),
    26 =>
        array (
            'code' => '507',
            'name' => 'بنما',
        ),
    27 =>
        array (
            'code' => '55',
            'name' => 'البرازيل',
        ),
    28 =>
        array (
            'code' => '375',
            'name' => 'بيلاروس',
        ),
    29 =>
        array (
            'code' => '1441',
            'name' => 'جزر برمودا',
        ),
    30 =>
        array (
            'code' => '359',
            'name' => 'بلغاريا',
        ),
    31 =>
        array (
            'code' => '229',
            'name' => 'بنن',
        ),
    32 =>
        array (
            'code' => '51',
            'name' => 'بيرو',
        ),
    33 =>
        array (
            'code' => '32',
            'name' => 'بلجيكا',
        ),
    34 =>
        array (
            'code' => '354',
            'name' => 'أيسلندا',
        ),
    35 =>
        array (
            'code' => '1787',
            'name' => 'بورتوريكو',
        ),
    36 =>
        array (
            'code' => '48',
            'name' => 'بولندا',
        ),
    37 =>
        array (
            'code' => '591',
            'name' => 'بوليفيا',
        ),
    38 =>
        array (
            'code' => '501',
            'name' => 'بليز',
        ),
    39 =>
        array (
            'code' => '267',
            'name' => 'بوتسوانا',
        ),
    40 =>
        array (
            'code' => '226',
            'name' => 'بوركينا فاسو',
        ),
    41 =>
        array (
            'code' => '257',
            'name' => 'بوروندي',
        ),
    42 =>
        array (
            'code' => '850',
            'name' => 'جمهورية كوريا الشعبية الديمقراطية',
        ),
    43 =>
        array (
            'code' => '45',
            'name' => 'الدانمرك',
        ),
    44 =>
        array (
            'code' => '49',
            'name' => 'ألمانيا',
        ),
    45 =>
        array (
            'code' => '228',
            'name' => 'توغو',
        ),
    46 =>
        array (
            'code' => '1890',
            'name' => 'الجمهورية الدومينيكية',
        ),
    47 =>
        array (
            'code' => '593',
            'name' => 'إكوادور',
        ),
    48 =>
        array (
            'code' => '7',
            'name' => 'روسيا',
        ),
    49 =>
        array (
            'code' => '33',
            'name' => 'فرنسا',
        ),
    50 =>
        array (
            'code' => '675',
            'name' => 'بولينيزيا الفرنسية',
        ),
    51 =>
        array (
            'code' => '594',
            'name' => 'غيانا الفرنسية',
        ),
    52 =>
        array (
            'code' => '679',
            'name' => 'فيجي',
        ),
    53 =>
        array (
            'code' => '63',
            'name' => 'الفلبين',
        ),
    54 =>
        array (
            'code' => '358',
            'name' => 'فنلندا',
        ),
    55 =>
        array (
            'code' => '242',
            'name' => 'الكونغو',
        ),
    56 =>
        array (
            'code' => '220',
            'name' => 'غامبيا',
        ),
    57 =>
        array (
            'code' => '1809',
            'name' => 'غرينادا',
        ),
    58 =>
        array (
            'code' => '57',
            'name' => 'كوبا',
        ),
    59 =>
        array (
            'code' => '995',
            'name' => 'جيم - جورجيا',
        ),
    60 =>
        array (
            'code' => '506',
            'name' => 'كوستاريكا',
        ),
    61 =>
        array (
            'code' => '53',
            'name' => 'كوبا',
        ),
    62 =>
        array (
            'code' => '1671',
            'name' => 'جيم - غوام',
        ),
    63 =>
        array (
            'code' => '592',
            'name' => 'غيانا',
        ),
    64 =>
        array (
            'code' => '327',
            'name' => 'كازاخستان',
        ),
    65 =>
        array (
            'code' => '509',
            'name' => 'هايتي',
        ),
    66 =>
        array (
            'code' => '82',
            'name' => 'كوريا الجنوبية',
        ),
    67 =>
        array (
            'code' => '31',
            'name' => 'هولندا',
        ),
    68 =>
        array (
            'code' => '504',
            'name' => 'هندوراس',
        ),
    69 =>
        array (
            'code' => '233',
            'name' => 'غانا',
        ),
    70 =>
        array (
            'code' => '1',
            'name' => 'كندا',
        ),
    71 =>
        array (
            'code' => '241',
            'name' => 'غابون',
        ),
    72 =>
        array (
            'code' => '224',
            'name' => 'غينيا',
        ),
    73 =>
        array (
            'code' => '420',
            'name' => 'الجمهورية التشيكية',
        ),
    74 =>
        array (
            'code' => '253',
            'name' => 'جيبوتي',
        ),
    75 =>
        array (
            'code' => '331',
            'name' => 'جيم - قيرغيزستان',
        ),
    76 =>
        array (
            'code' => '855',
            'name' => 'المملكة المتحدة',
        ),
    77 =>
        array (
            'code' => '263',
            'name' => 'جيم - زمبابوي',
        ),
    78 =>
        array (
            'code' => '237',
            'name' => 'الكاميرون',
        ),
    79 =>
        array (
            'code' => '974',
            'name' => 'قطر',
        ),
    80 =>
        array (
            'code' => '225',
            'name' => 'جمهورية كوت ديفوار',
        ),
    81 =>
        array (
            'code' => '965',
            'name' => 'الكويت',
        ),
    82 =>
        array (
            'code' => '254',
            'name' => 'كينيا',
        ),
    83 =>
        array (
            'code' => '682',
            'name' => 'جزر كوك',
        ),
    84 =>
        array (
            'code' => '371',
            'name' => 'لاتفيا',
        ),
    85 =>
        array (
            'code' => '266',
            'name' => 'ليسوتو',
        ),
    86 =>
        array (
            'code' => '856',
            'name' => 'جمهورية لاو الديمقراطية',
        ),
    87 =>
        array (
            'code' => '961',
            'name' => 'لبنان',
        ),
    88 =>
        array (
            'code' => '423',
            'name' => 'ليختنشتاين',
        ),
    89 =>
        array (
            'code' => '231',
            'name' => 'جيم - ليبريا',
        ),
    90 =>
        array (
            'code' => '218',
            'name' => 'ليبيا',
        ),
    91 =>
        array (
            'code' => '370',
            'name' => 'ليتوانيا',
        ),
    92 =>
        array (
            'code' => '352',
            'name' => '(توقيع) لوسيا',
        ),
    93 =>
        array (
            'code' => '40',
            'name' => 'رومانيا',
        ),
    94 =>
        array (
            'code' => '960',
            'name' => 'ملديف',
        ),
    95 =>
        array (
            'code' => '356',
            'name' => 'جيم - مالطة',
        ),
    96 =>
        array (
            'code' => '1',
            'name' => 'الولايات المتحدة',
        ),
    97 =>
        array (
            'code' => '261',
            'name' => 'مدغشقر',
        ),
    98 =>
        array (
            'code' => '265',
            'name' => 'ملاوي',
        ),
    99 =>
        array (
            'code' => '60',
            'name' => 'ماليزيا',
        ),
    100 =>
        array (
            'code' => '223',
            'name' => 'جيم - مالي',
        ),
    101 =>
        array (
            'code' => '230',
            'name' => 'موريشيوس',
        ),
    102 =>
        array (
            'code' => '976',
            'name' => 'منغوليا',
        ),
    103 =>
        array (
            'code' => '1664',
            'name' => 'جزيرة مونتسيرات',
        ),
    104 =>
        array (
            'code' => '95',
            'name' => 'جيم - ميانمار',
        ),
    105 =>
        array (
            'code' => '373',
            'name' => 'جمهورية مولدوفا',
        ),
    106 =>
        array (
            'code' => '880',
            'name' => 'بنغلاديش',
        ),
    107 =>
        array (
            'code' => '212',
            'name' => 'المملكة المتحدة',
        ),
    108 =>
        array (
            'code' => '377',
            'name' => 'موناكو',
        ),
    109 =>
        array (
            'code' => '52',
            'name' => 'المكسيك',
        ),
    110 =>
        array (
            'code' => '258',
            'name' => 'موزامبيق',
        ),
    111 =>
        array (
            'code' => '264',
            'name' => 'ناميبيا',
        ),
    112 =>
        array (
            'code' => '27',
            'name' => 'جنوب أفريقيا',
        ),
    113 =>
        array (
            'code' => '381',
            'name' => 'يوغوسلافيا',
        ),
    114 =>
        array (
            'code' => '674',
            'name' => 'ناورو',
        ),
    115 =>
        array (
            'code' => '505',
            'name' => 'نيكاراغوا',
        ),
    116 =>
        array (
            'code' => '977',
            'name' => 'نيبال',
        ),
    117 =>
        array (
            'code' => '977',
            'name' => 'النيجر',
        ),
    118 =>
        array (
            'code' => '234',
            'name' => 'جيم - نيجيريا',
        ),
    119 =>
        array (
            'code' => '47',
            'name' => 'النرويج',
        ),
    120 =>
        array (
            'code' => '351',
            'name' => 'البرتغال',
        ),
    121 =>
        array (
            'code' => '81',
            'name' => 'اليابان',
        ),
    122 =>
        array (
            'code' => '46',
            'name' => 'السويد',
        ),
    123 =>
        array (
            'code' => '41',
            'name' => 'سويسرا',
        ),
    124 =>
        array (
            'code' => '503',
            'name' => 'السلفادور',
        ),
    125 =>
        array (
            'code' => '53',
            'name' => 'جيم - قبرص',
        ),
    126 =>
        array (
            'code' => '232',
            'name' => 'سيراليون',
        ),
    127 =>
        array (
            'code' => '221',
            'name' => 'السنغال',
        ),
    128 =>
        array (
            'code' => '248',
            'name' => 'سيشيل',
        ),
    129 =>
        array (
            'code' => '966',
            'name' => 'السعودية',
        ),
    130 =>
        array (
            'code' => '239',
            'name' => 'سان تومي وبرينسيبي',
        ),
    131 =>
        array (
            'code' => '1758',
            'name' => 'سانت لوسيا',
        ),
    132 =>
        array (
            'code' => '378',
            'name' => 'سان مارينو',
        ),
    133 =>
        array (
            'code' => '94',
            'name' => 'سري لانكا',
        ),
    134 =>
        array (
            'code' => '386',
            'name' => 'سلوفينيا',
        ),
    135 =>
        array (
            'code' => '421',
            'name' => 'سلوفاكيا',
        ),
    136 =>
        array (
            'code' => '268',
            'name' => 'سوازيلند',
        ),
    137 =>
        array (
            'code' => '249',
            'name' => 'السودان',
        ),
    138 =>
        array (
            'code' => '597',
            'name' => 'سورينام',
        ),
    139 =>
        array (
            'code' => '1784',
            'name' => 'جزيرة سانت فنسنت',
        ),
    140 =>
        array (
            'code' => '677',
            'name' => 'جزر سليمان',
        ),
    141 =>
        array (
            'code' => '252',
            'name' => 'الصومال',
        ),
    142 =>
        array (
            'code' => '992',
            'name' => 'طاجيكستان',
        ),
    143 =>
        array (
            'code' => '66',
            'name' => 'تايلند',
        ),
    144 =>
        array (
            'code' => '255',
            'name' => 'تنزانيا',
        ),
    145 =>
        array (
            'code' => '676',
            'name' => 'تونغا',
        ),
    146 =>
        array (
            'code' => '886',
            'name' => 'تايوان (الصين)',
        ),
    147 =>
        array (
            'code' => '1809',
            'name' => 'ترينيداد وتوباغو',
        ),
    148 =>
        array (
            'code' => '993',
            'name' => 'تركمانستان',
        ),
    149 =>
        array (
            'code' => '216',
            'name' => 'تونس',
        ),
    150 =>
        array (
            'code' => '90',
            'name' => 'تركيا',
        ),
    151 =>
        array (
            'code' => '502',
            'name' => 'جيم - غواتيمالا',
        ),
    152 =>
        array (
            'code' => '58',
            'name' => 'فنزويلا',
        ),
    153 =>
        array (
            'code' => '673',
            'name' => 'بروني',
        ),
    154 =>
        array (
            'code' => '256',
            'name' => 'أوغندا',
        ),
    155 =>
        array (
            'code' => '380',
            'name' => 'أوكرانيا',
        ),
    156 =>
        array (
            'code' => '598',
            'name' => 'أوروغواي',
        ),
    157 =>
        array (
            'code' => '233',
            'name' => 'جمهورية أوزبكستان',
        ),
    158 =>
        array (
            'code' => '34',
            'name' => 'إسبانيا',
        ),
    159 =>
        array (
            'code' => '30',
            'name' => 'اليونان',
        ),
    160 =>
        array (
            'code' => '852',
            'name' => 'هونغ كونغ (الصين)',
        ),
    161 =>
        array (
            'code' => '65',
            'name' => 'سنغافورة',
        ),
    162 =>
        array (
            'code' => '64',
            'name' => 'نيوزيلندا',
        ),
    163 =>
        array (
            'code' => '36',
            'name' => 'هنغاريا',
        ),
    164 =>
        array (
            'code' => '963',
            'name' => 'الجمهورية السورية',
        ),
    165 =>
        array (
            'code' => '1876',
            'name' => 'جيم - جامايكا',
        ),
    166 =>
        array (
            'code' => '967',
            'name' => 'اليمن',
        ),
    167 =>
        array (
            'code' => '39',
            'name' => 'إيطاليا',
        ),
    168 =>
        array (
            'code' => '964',
            'name' => 'العراق',
        ),
    169 =>
        array (
            'code' => '98',
            'name' => 'إيران',
        ),
    170 =>
        array (
            'code' => '972',
            'name' => 'إسرائيل',
        ),
    171 =>
        array (
            'code' => '97',
            'name' => 'الهند',
        ),
    172 =>
        array (
            'code' => '62',
            'name' => 'إندونيسيا',
        ),
    173 =>
        array (
            'code' => '44',
            'name' => 'المملكة المتحدة',
        ),
    174 =>
        array (
            'code' => '962',
            'name' => 'الأردن',
        ),
    175 =>
        array (
            'code' => '84',
            'name' => 'فييت نام',
        ),
    176 =>
        array (
            'code' => '260',
            'name' => 'زامبيا',
        ),
    177 =>
        array (
            'code' => '235',
            'name' => 'تشاد',
        ),
    178 =>
        array (
            'code' => '243',
            'name' => 'زاير',
        ),
    179 =>
        array (
            'code' => '350',
            'name' => 'جيم - جبل طارق',
        ),
    180 =>
        array (
            'code' => '56',
            'name' => 'جيم - شيلي',
        ),
    181 =>
        array (
            'code' => '236',
            'name' => 'جمهورية أفريقيا الوسطى',
        ),
    182 =>
        array (
            'code' => '86',
            'name' => 'جيم - المملكة العربية السعودية',
        ),
);