<?php
/**
 * 短视频
 */
namespace app\appapi\controller;


use think\Controller;
use think\Db;
use Qcloud\Cos\Client;

class VideoController extends Controller
{

    function index()
    {
        $data = $this->request->param();
        $videoid = isset($data['videoid']) ? $data['videoid'] : '';
        $videoid = (int)checkNull($videoid);

        if (!$videoid) {
            $this->assign("reason", lang('信息错误'));
            return $this->fetch(':error');
        }


        $videoinfo = Db::name('video')->where(["id" => $videoid])->find();

        if (!$videoinfo) {
            $this->assign("reason", lang('视频不存在'));
            return $this->fetch(':error');
        }

        $liveinfo = getUserInfo($videoinfo['uid']);

        $hls = get_upload_path($videoinfo['href']);

        $this->assign("hls", $hls);
        $this->assign("videoinfo", $videoinfo);
        $this->assign("liveinfo", $liveinfo);

        return $this->fetch();
    }

    function watermark()
    {
        $data = $this->request->post();
        $video_url = $data['href'];
        $video = explode('/', $video_url);
        $video_h = explode('.', $video[2]);
        $video_watermark_url = $video[0].'/'.$video[1].'/'.$video_h[0].'_water.'.$video_h[1];

        $configPri = getConfigPri();
        $secretId = $configPri['qcloud_secret_id'];
        $secretKey = $configPri['qcloud_secret_key'];
        $region = $configPri['qcloud_region'];
        $bucket = $configPri['qcloud_bucket'];
        $video_watermark = $configPri['video_watermark'];
        $cosClient = new Client(
            array(
                'region' => $region,
                'scheme' => 'https', // 审核时必须为https
                'credentials'=> array(
                    'secretId'  => $secretId ,
                    'secretKey' => $secretKey)));
        try {

            $name = explode('/', $video_watermark);
            $name = explode('.', $name[2]);

            if(isset($configPri['video_watermark_template_id'])){
                $id = $configPri['video_watermark_template_id'];
            }else{
                $result = $cosClient->CreateWatermarkTemplate(array(
                    'Bucket' => $bucket, //存储桶名称，由BucketName-Appid 组成，可以在COS控制台查看 https://console.cloud.tencent.com/cos5/bucket
                    'Headers' => array(
                        'Content-Type' => 'application/xml',
                    ),
                    'Tag'=> 'Watermark', // 模板类型: Watermark;是否必传：否
                    'Name'=> $name, // 模板名称，仅支持中文、英文、数字、_、-和*，长度不超过 64;是否必传：否
                    // 水印信息;是否必传：否
                    'Watermark'=> array(
                        'Type'=> 'Text', // 水印类型Text：文字水印Image：图片水印;是否必传：是
                        'Pos'=> 'BottomRight', // 基准位置TopRightTopLeftBottomRightBottomLeftLeftRightTopBottomCenter;是否必传：是
                        'LocMode'=> 'Relativity', // 偏移方式Relativity：按比例Absolute：固定位置;是否必传：是
                        'Dx'=> '0', // 水平偏移在图片水印中，如果 Background 为 true，当 locMode 为 Relativity 时，为%，值范围：[-300 0]；当 locMode 为 Absolute 时，为 px，值范围：[-4096 0]。在图片水印中，如果 Background 为 false，当 locMode 为 Relativity 时，为%，值范围：[0 100]；当 locMode 为 Absolute 时，为 px，值范围：[0 4096]。在文字水印中，当 locMode 为 Relativity 时，为%，值范围：[0 100]；当 locMode 为 Absolute 时，为 px，值范围：[0 4096]。当Pos为Top、Bottom和Center时，该参数无效。;是否必传：是
                        'Dy'=> '0', // 垂直偏移在图片水印中，如果 Background 为 true，当 locMode 为 Relativity 时，为%，值范围：[-300 0]；当 locMode 为 Absolute 时，为 px，值范围：[-4096 0]。在图片水印中，如果 Background 为 false，当 locMode 为 Relativity 时，为%，值范围：[0 100]；当 locMode 为 Absolute 时，为 px，值范围：[0 4096]。在文字水印中，当 locMode 为 Relativity 时，为%，值范围：[0 100]；当 locMode 为 Absolute 时，为 px，值范围：[0 4096]。当Pos为Left、Right和Center时，该参数无效。;是否必传：是
                        'StartTime'=> '0', // 水印开始时间[0，视频时长]  单位为秒 支持 float 格式，执行精度精确到毫秒;是否必传：否
                        'EndTime'=> '', // 水印结束时间[0，视频时长] 单位为秒 支持 float 格式，执行精度精确到毫秒;是否必传：否
                        'Text' => array(
                            'Text' => 'test',
                            'FontSize' => '30',
                            'FontType' => 'simfang.ttf',
                            'FontColor' => '0x000000',
                            'Transparency' => '90',
                        ),
                    ),
                ));
                $id = $result['Template']['TemplateId'];
            }

            //提交一个视频明水印任务
            $result = $cosClient->PostWatermarkJobs(array(
                'Bucket' => $bucket, //存储桶名称，由BucketName-Appid 组成，可以在COS控制台查看 https://console.cloud.tencent.com/cos5/bucket
                'Headers' => array(
                    'Content-Type' => 'application/xml',
                ),
                'Tag'=> 'Watermark', // 创建任务的Tag：Watermark;是否必传：是
                // 待操作的文件信息;是否必传：是
                'Input'=> array(
                    'Object'=> $video_url, // 待处理的文件路径;是否必传：是
                ),
                // 操作规则;是否必传：是
                'Operation'=> array(
                    'WatermarkTemplateId'=> $id, // 水印模板 ID，可以传多个水印模板 ID ，最多传3个;是否必传：否
                    'Output' => array(
                        'Region' => $region,
                        'Bucket' => $bucket,
                        'Object' => $video_watermark_url,
                    ),
                ),
            ));
            // 请求成功
        } catch (\Exception $e) {
            // 请求失败
            echo json_encode(array("ret"=>400,'data'=>array("url"=>$video_url),'msg'=>$e));
            exit;
        }
        echo json_encode(array("ret"=>200,'data'=>array("url"=>$video_watermark_url),'msg'=>''));
        exit;

    }

    /**
     * 上传测试视频
     * @desc 用于获取水印视频链接
     * @return int code 操作码，0表示成功
     * @return array info
     * @return string msg 提示信息
     */
    public function addTestVideo() {
        $uiDs = [
            43451,43455,43458
        ];
        $videoName0 = [
            '摩托配美女',
            '探清水河太雅了 韩小九 探清水河 音乐推荐 户外唱歌',
            '土耳其，加拉塔塔是伊斯坦布尔历史区的一座中世纪塔楼，是该市最著名的历史和建筑古迹之一。',
            '希腊的雅典卫城是必游之地，因为那里可以欣赏到雅典的壮丽景色和令人印象深刻的古代遗迹，例如帕台农神庙。',
            '希腊日落时分的米科诺斯岛海滨餐厅。',
            '音乐：情感',
            '印度尼西亚天堂岛巴厘岛的早安🇮🇩',
            '瑜伽裤#你的姨',
            '这还拿不下你？#黑色系 #御姐',
        ];
        $goodsids0 = [
            5,
            2,
            2,
            2,
            1,
            3,
            2,
            4,
            5,
        ];
        $videoName1 = [
            '#变身小说封面 这个书名怎么有种黄昏恋的感jio😲',
            '#东方美 #旗袍美人 #新中式 #国风计划 明明明月是前身。回头成一笑，清冷几千春。',
            '#仿图 #韩漫 #富家女姐姐',
            '#歌收藏了就等另一半官宣了',
            '竖屏有配音有字幕995',
            '随便扭扭',
            '我猜你喜欢#御姐 #猫系女友',
            '蒸汽机普芬比利，墨尔本，澳大利亚。旅游机车“普芬比利”（Puffing Billy）从墨尔本遥远的郊区出发，悠闲地在森林里穿行穿过丹德农山脉。',
            '直男审美？挑战太古里街拍！#完美身材',
            '猪的天堂岛。许多游客来这里是为了看那些不怕人的野生家猪，它们喜欢在海滩上嬉戏、晒太阳。',
        ];
        $goodsids1 = [
            5,
            5,
            5,
            3,
            3,
            4,
            4,
            2,
            4,
            2,
        ];
        $anyway1 = [
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
        ];
        $videoName2 = [
            '#北方的狼族登场 #北方的狼族申请出战 这是……狼族公主和她的小娇妻？',
            '#北漠公主挑战 #wlop  #风曳公主 #鬼刀 #异域风情 “她是北漠最绚丽的火蝶。”',
            '#古风 #国风 #原创古风计划 “水中幻月，镜中花。”',
            '#光剑变装挑战 没想到吧',
            '#国风  #汉服 #原创国风计划 “十年生死两茫茫，不思量，自难忘。”',
            '#国风 #国风正当红 #新年 #虎头帽 戴上虎头帽🐯 阿仓来报道～祝大家冬至快乐呀！！',
            '#国风大典承包我一整年的惊艳 #汉服走秀 #国风大典 “我虽天生媚骨，却从不以色侍人。”',
            '#拿什么跟我抗衡',
            '#我不介意取而代之 #倪克斯神谕 #氛围感',
            '#遇见她如春水映梨花 #西域舞姬',
        ];
        $goodsids2 = [
            5,
            5,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
        ];
        $anyway2 = [
            '0.9',
            '0.9',
            '1.1',
            '0.9',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
        ];
        $videoName3 = [
            '#国风合伙人 #汉服 #卓大王盲盒  “广寒宫内，你猜我是谁？”#卓大王 #古今穿越变装',
            '#国风合伙人 #与你斗山海 #古风 万圣节国风战队，小狐妖九尾申请出战～',
            '#国风正当红  #汉服  #温柔 “传说中为爱搁浅的小人鱼，被囚于方寸之地，眼泪都化作珍珠……”',
            '#黑色系 #御姐',
            '#置顶第一条 #甜御 #电子娇妻',
            '“艾特你的牛马朋友来看”',
            '“北林有燕，雨落雪兮。朔风哀哀，比翼难飞。”#秦时沧海花式应援催更 #秦时明月沧海手游 #雪女 #秦时明月 #国风',
            '“被我看见，你就是我的人咯”#睁眼变装 #永劫将至 #宁红夜',
            '“卡哇1也是1”#花絮 #国风合伙人 #异域风情',
            '“可是你的眼睛分明告诉我，你动心了。”#惊鸿一瞥 #撩人 #焰灵姬cos #氛围感',
        ];
        $goodsids3 = [
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
        ];
        $anyway3 = [
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
        ];
        $videoName4 = [
            '“不入火海，怎能品尝烈焰焚身的滋味……” #天行九歌 #焰灵姬cos #惊鸿一瞥 #国漫女神',
            '“公子莫怕，花妖是不伤人的……”#惊鸿一瞥  #古风 #逆水寒手游 #逆水寒',
            '“泪痣是烙印在此生中，两滴无法抹去的泪。”#鬼刀 #wlop #海琴烟 #cos #鬼刀冰公主',
            '“凌晨四点 我看见海棠花未眠”  #歌曲一卷万寿 #惊鸿一瞥 #国风合伙人 #国风计划',
            '“让姬子带你杀出重围！”#崩坏星穹铁道 #通往群星的轨道 #星穹之旅 #cos',
            '“想在这样的小镇里，与你偕老。” #惊鸿一瞥 #意境 #旗袍 #江南烟雨色',
            '《关于慢动作变装合集之你几点回家》#变装合集',
            '……上个西施的被人搬了，我服了',
            '005 饭饭麻麻菜菜-有没有懂日语的听听她在说啥 一个kitty玩具，玩着玩着就学会了 我完全听不懂啊人类 幼崽到底有多可爱 这 么 可爱真是抱歉',
            '10秒了解意大利暑假的氛围🇮🇹',
        ];
        $goodsids4 = [
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            4,
            3,
            2,
        ];
        $anyway4 = [
            '1.1',
            '1.1',
            '0.9',
            '0.9',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
        ];
        $videoName5 = [
            '0.0 这是尊嘟假嘟？#女生怎么能不穿一次JK#纯情女高 #jk制服 #jk',
            '001 饭饭麻麻菜菜-好羡慕女儿的松弛感 人类幼崽到底有多可爱 人类幼崽迷惑行为大赏',
            '011 饭饭麻麻菜菜-我的审美vs我女儿的长相 骗你生女儿 治愈系笑容 人类幼崽到底有多可爱',
            '016 饭饭麻麻菜菜-大家帮我看看，这是德善和阿泽吗？亲妈滤镜哈哈哈，好可爱 人类幼崽到底有多可爱 请回答1988',
            '078 饭饭麻麻菜菜-隔离了好自由！不上学好开心！人类幼崽到底有多可爱 你家孩子也这样吗',
            '081 饭饭麻麻菜菜-蛋卷头教程！慵懒氛围感拉满！生女儿就是用来打扮的 蛋卷头 女生发型',
            '爱的天罚，由我降下 #美少女战士  #光落在你脸上 #纯情女高  #水冰月变身 #美少女战士cos神还原',
            '爱尔兰伊尼斯梅恩山岩石上的自然力量',
            '白羊座也是可以穿越的#兰亭序 #古风美女能有多绝 #古风清冷感妆容',
            '拜托了前辈 学姐版 #拜托啦前辈 #纯情女高 #学姐 #jk #jk甜妹的秋冬穿搭',
        ];
        $goodsids5 = [
            4,
            3,
            3,
            3,
            3,
            3,
            4,
            2,
            4,
            4,
        ];
        $anyway5 = [
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
        ];
        $videoName6 = [
            '爱尔兰在游客中非常受欢迎，这是有原因的！首先，这里的童话城堡和庄园值得一游。该国的另一个亮点是其几乎未受破坏的自然景观。',
            '爱人者予人牢笼，囚人者终将自囚。#消失的她文咏珊黑裙变装 #消失的她',
            '帮我艾特你最好的朋友来看 谢谢 #御姐 #拽姐穿搭 #时髦好物ootd #早春穿搭论',
            '玻利维亚乌尤尼盐沼上的神奇日落，乌尤尼盐沼是世界上最大的盐沼，面积为 10,582 平方公里，位于玻利维亚南部。在雨季，盐沼上覆盖着一层薄薄的水，变成了世界上最大的镜面。',
            '博茨瓦纳大草原的日落🇧🇼',
            '不一定要斩男 但一定要斩女#迦南 #西域舞姬',
            '臭宝，孙子兵法背了吗？#撩人 #御姐 #读孙子兵法品启强人生 #国风',
            '初一看__  顺风顺水 #春丽 #cos #二次元 #二次元年味的打开方式',
            '当你的天空突然下起了大雨',
            '滴！你的昏君体验卡～#异域风情 #西域风情 #国风合伙人',
        ];
        $goodsids6 = [
            2,
            4,
            4,
            2,
            2,
            4,
            4,
            4,
            3,
            4,
        ];
        $anyway6 = [
            '1.1',
            '0.9',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '0.9',
        ];
        $videoName7 = [
            '穿件窗花新装，迎接兔年喽～#春节剪纸变装挑战 #倩女火种计划 #倩女幽魂手游 #想看看你的新年穿搭',
            '代入感很强，已经在帮她擦身体乳了。#逆水寒手游 #逆水寒情人节钻石时装 #惊鸿一瞥',
            '东方美学永不过时#黑长直 #东方美学 #古韵景粼最美女神',
            '方秘书为何那样 #黑长直 #御姐 #黑色系 #拽姐穿搭 #请和黑色系穿搭锁死',
            '风浪越大 鱼越贵 #我想吃鱼了 #风浪越大鱼更贵 #狂飙后遗症',
            '孤独的岛 躺在大海的怀抱 #黑长直 #棒球 #早春辣妹我先当了 #孤独的岛',
            '关注公众号微友服务站',
            '哈萨克斯坦科尔塞湖周边风景秀丽，大自然保留了这个角落的原始面貌，周围景观的宁静与安宁让人想融入其中。',
            '会扣篮的女生有多加分？#篮球🏀',
            '今日无事，趁着春光抓一只小兔妖吧～ #长安幻想花朝节 #葫芦里装的什么妖#长安幻想',
        ];
        $goodsids7 = [
            4,
            4,
            4,
            4,
            4,
            4,
            3,
            2,
            3,
            4,
        ];
        $anyway7 = [
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
        ];
        $videoName8 = [
            '回复 @懿鹿相随的评论 嘘！我没意见#变装',
            '回复 @忠于雷霆的评论  哒哒哒哒哒#置顶第一条',
            '今天的点赞是月亮哦～#中秋吟月飞花令 #抖音华彩追月夜 #古韵',
            '精品搞笑',
            '卡萨米尔是阿尔巴尼亚最南端的度假胜地，位于爱奥尼亚海沿岸。',
            '克尔卡以其层叠的天然瀑布、湖泊和河中的美丽岛屿而闻名。该公园特别吸引人，因为它允许在瀑布中游泳，而这在巴尔干国家公园通常是禁止的。',
            '励志：奋斗 改变自己，翻盘人生',
            '令人难以置信的白色沙滩，也门索科特拉岛',
            '你可曾听过……关于羽族的传说？#2024年再次听完美世界#完美世界手游5周年#水木年华',
            '你连我都不赞 你赞什么  暂时将你眼睛闭了起来吗',
        ];
        $goodsids8 = [
            4,
            4,
            4,
            7,
            2,
            2,
            2,
            2,
            5,
            5,
        ];
        $anyway8 = [
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
        ];
        $videoName9 = [
            '旅行者，茶馆客满了的话……不如来必胜客坐坐吧～#原神 #风花的呼吸  #原神必胜客 #一种很新的cosplay #凝光cos',
            '美食：烧烤风大阪烧',
            '美食系列竖屏全屏（有配音有字幕）50个',
            '明天就是小玲珑的生日了～主公记得来哦#乱世王者@乱世王者 #惊鸿一瞥 #cos',
            '你说 公主请踩我 #男友视角 #黑色系 #御姐 #氛围感的尽头是高糊',
            '评论区不许出现oi',
            '齐刘海也不错',
            '情感励志系列（有配音有字幕）1621个',
            '竖屏有配音无字幕300个',
            '这样可以吗#你的姨',
        ];
        $goodsids9 = [
            3,
            1,
            1,
            5,
            4,
            4,
            4,
            7,
            7,
            4,
        ];
        $anyway9 = [
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '1.1',
            '0.9',
            '0.9',
            '1.1',
        ];

        foreach ($videoName9 as $k => $v) {
            $z = $k+1;
            $curlPost['uid'] = $uiDs[rand(0,2)];
            $curlPost['title'] = $v;
            $curlPost['href'] = 'upload/video/10/'.$z.'.mp4';
            $curlPost['thumb'] = 'upload/video/10/'.$z.'.jpg';
            $curlPost['lat'] = '22.961229';
            $curlPost['lng'] = '114.746594';
            $curlPost['city'] = '惠州市';
            $curlPost['anyway'] = $anyway9[$k];
            $curlPost['classid'] = $goodsids9[$k];
            $curlPost['service'] = 'Video.SetVideo';
//            $re = curlPost($curlPost,'https://test.popolive.net/appapi/');

        }
    }
}